/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ppcL2CacheQorIQ.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2018 年 08 月 07 日
**
** 描        述: QorIQ 体系构架 L2 CACHE 驱动.
*********************************************************************************************************/

#ifndef __ARCH_PPCL2CACHEQORIQ_H
#define __ARCH_PPCL2CACHEQORIQ_H

typedef struct {
    BOOL        CFG_bPresent;                                           /*  是否存在 L2 CACHE           */
    size_t      CFG_stSize;                                             /*  L2 CACHE 大小               */
    addr_t      CFG_ulBase;                                             /*  L2 CACHE 控制器基地址       */
} PPC_QORIQ_L2CACHE_CONFIG;

VOID  ppcQorIQL2CacheConfig(PPC_QORIQ_L2CACHE_CONFIG  *pL2Config);

#endif                                                                  /*  __ARCH_PPCL2CACHEQORIQ_H    */
/*********************************************************************************************************
  END
*********************************************************************************************************/
