/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: riscvVfp.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2018 年 03 月 20 日
**
** 描        述: RISC-V 体系架构 FPU 支持.
*********************************************************************************************************/

#ifndef __ARCH_RISCV_VFP_H
#define __ARCH_RISCV_VFP_H

PRISCV_FPU_OP   riscvVfpPrimaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);
VOID            riscvVfpSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcFpuName);

#endif                                                                  /*  __ARCH_RISCV_VFP_H          */
/*********************************************************************************************************
  END
*********************************************************************************************************/
