/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: mipsHr2Vector.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2018 年 02 月 24 日
**
** 描        述: 华睿 2 号处理器向量运算单元支持.
*********************************************************************************************************/

#ifndef __ARCH_MIPSHR2VECTOR_H
#define __ARCH_MIPSHR2VECTOR_H

PMIPS_DSP_OP  mipsHr2VectorPrimaryInit(CPCHAR    pcMachineName, CPCHAR  pcDspName);
VOID          mipsHr2VectorSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcDspName);

#endif                                                                  /*  __ARCH_MIPSHR2VECTOR_H      */
/*********************************************************************************************************
  END
*********************************************************************************************************/
