/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ppcDspNone.c
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2018 年 01 月 10 日
**
** 描        述: PowerPC 体系架构无 DSP 支持.
*********************************************************************************************************/
#define  __SYLIXOS_STDIO
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if LW_CFG_CPU_DSP_EN > 0
#include "../ppcDsp.h"
/*********************************************************************************************************
  全局变量
*********************************************************************************************************/
static PPC_DSP_OP   _G_dspopDspNone;
/*********************************************************************************************************
** 函数名称: ppcDspNoneEnable
** 功能描述: 使能 DSP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  ppcDspNoneEnable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: ppcDspNoneDisable
** 功能描述: 禁能 DSP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  ppcDspNoneDisable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: ppcDspNoneIsEnable
** 功能描述: 是否使能了 DSP
** 输　入  : NONE
** 输　出  : 是否使能
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static BOOL  ppcDspNoneIsEnable (VOID)
{
    return  (LW_TRUE);
}
/*********************************************************************************************************
** 函数名称: ppcDspNoneSave
** 功能描述: 保存 DSP 上下文
** 输　入  : pvDspCtx  DSP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  ppcDspNoneSave (PVOID pvDspCtx)
{
}
/*********************************************************************************************************
** 函数名称: ppcDspNoneRestore
** 功能描述: 恢复 DSP 上下文
** 输　入  : pvDspCtx  DSP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  ppcDspNoneRestore (PVOID pvDspCtx)
{
}
/*********************************************************************************************************
** 函数名称: ppcDspNoneCtxShow
** 功能描述: 显示 DSP 上下文
** 输　入  : iFd       输出文件描述符
**           pvDspCtx  DSP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  ppcDspNoneCtxShow (INT  iFd, PVOID  pvDspCtx)
{
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_FIO_LIB_EN > 0)
    fdprintf(iFd, "no dsp\n");
#endif
}
/*********************************************************************************************************
** 函数名称: ppcDspNoneEnableTask
** 功能描述: 系统发生 DSP 不可用异常时, 使能任务的 DSP
** 输　入  : ptcbCur    当前任务控制块
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
static VOID  ppcDspNoneEnableTask (PLW_CLASS_TCB  ptcbCur)
{
}
/*********************************************************************************************************
** 函数名称: ppcDspNonePrimaryInit
** 功能描述: 获取 DSP 控制器操作函数集
** 输　入  : pcMachineName 机器名
** 输　出  : 操作函数集
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PPPC_DSP_OP  ppcDspNonePrimaryInit (CPCHAR  pcMachineName, CPCHAR  pcDspName)
{
    _G_dspopDspNone.PDSP_pfuncEnable     = ppcDspNoneEnable;
    _G_dspopDspNone.PDSP_pfuncDisable    = ppcDspNoneDisable;
    _G_dspopDspNone.PDSP_pfuncIsEnable   = ppcDspNoneIsEnable;
    _G_dspopDspNone.PDSP_pfuncSave       = ppcDspNoneSave;
    _G_dspopDspNone.PDSP_pfuncRestore    = ppcDspNoneRestore;
    _G_dspopDspNone.PDSP_pfuncCtxShow    = ppcDspNoneCtxShow;
    _G_dspopDspNone.PDSP_pfuncEnableTask = ppcDspNoneEnableTask;

    return  (&_G_dspopDspNone);
}
/*********************************************************************************************************
** 函数名称: ppcDspNoneSecondaryInit
** 功能描述: 初始化 DSP 控制器
** 输　入  : pcMachineName 机器名
**           pcDspName     DSP 名
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  ppcDspNoneSecondaryInit (CPCHAR  pcMachineName, CPCHAR  pcDspName)
{
    (VOID)pcMachineName;
    (VOID)pcDspName;
}

#endif                                                                  /*  LW_CFG_CPU_DSP_EN > 0       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
