/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ppcDspNone.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2018 年 01 月 10 日
**
** 描        述: PowerPC 体系架构无 DSP 支持.
*********************************************************************************************************/

#ifndef __ARCH_PPCDSPNONE_H
#define __ARCH_PPCDSPNONE_H

PPPC_DSP_OP  ppcDspNonePrimaryInit(CPCHAR    pcMachineName, CPCHAR  pcDspName);
VOID         ppcDspNoneSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcDspName);

#endif                                                                  /*  __ARCH_PPCDSPNONE_H         */
/*********************************************************************************************************
  END
*********************************************************************************************************/
