/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: mipsDspNone.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2018 年 01 月 10 日
**
** 描        述: MIPS 体系架构无 DSP 支持.
*********************************************************************************************************/

#ifndef __ARCH_MIPSDSPNONE_H
#define __ARCH_MIPSDSPNONE_H

PMIPS_DSP_OP  mipsDspNonePrimaryInit(CPCHAR    pcMachineName, CPCHAR  pcDspName);
VOID          mipsDspNoneSecondaryInit(CPCHAR  pcMachineName, CPCHAR  pcDspName);

#endif                                                                  /*  __ARCH_MIPSDSPNONE_H        */
/*********************************************************************************************************
  END
*********************************************************************************************************/
