/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: mipsDspNone.c
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2018 年 01 月 10 日
**
** 描        述: MIPS 体系架构无 DSP 支持.
*********************************************************************************************************/
#define  __SYLIXOS_STDIO
#define  __SYLIXOS_KERNEL
#include "SylixOS.h"
/*********************************************************************************************************
  裁剪支持
*********************************************************************************************************/
#if LW_CFG_CPU_DSP_EN > 0
#include "../mipsDsp.h"
/*********************************************************************************************************
  全局变量
*********************************************************************************************************/
static MIPS_DSP_OP   _G_dspopDspNone;
/*********************************************************************************************************
** 函数名称: mipsDspNoneEnable
** 功能描述: 使能 DSP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  mipsDspNoneEnable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: mipsDspNoneDisable
** 功能描述: 禁能 DSP
** 输　入  : NONE
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  mipsDspNoneDisable (VOID)
{
}
/*********************************************************************************************************
** 函数名称: mipsDspNoneIsEnable
** 功能描述: 是否使能了 DSP
** 输　入  : NONE
** 输　出  : 是否使能
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static BOOL  mipsDspNoneIsEnable (VOID)
{
    return  (LW_TRUE);
}
/*********************************************************************************************************
** 函数名称: mipsDspNoneSave
** 功能描述: 保存 DSP 上下文
** 输　入  : pvDspCtx  DSP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  mipsDspNoneSave (PVOID pvDspCtx)
{
}
/*********************************************************************************************************
** 函数名称: mipsDspNoneRestore
** 功能描述: 恢复 DSP 上下文
** 输　入  : pvDspCtx  DSP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  mipsDspNoneRestore (PVOID pvDspCtx)
{
}
/*********************************************************************************************************
** 函数名称: mipsDspNoneCtxShow
** 功能描述: 显示 DSP 上下文
** 输　入  : iFd       输出文件描述符
**           pvDspCtx  DSP 上下文
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
static VOID  mipsDspNoneCtxShow (INT  iFd, PVOID  pvDspCtx)
{
#if (LW_CFG_DEVICE_EN > 0) && (LW_CFG_FIO_LIB_EN > 0)
    fdprintf(iFd, "no dsp\n");
#endif
}
/*********************************************************************************************************
** 函数名称: mipsDspNoneEnableTask
** 功能描述: 系统发生 DSP 不可用异常时, 使能任务的 DSP
** 输　入  : ptcbCur    当前任务控制块
** 输　出  : NONE
** 全局变量:
** 调用模块:
*********************************************************************************************************/
static VOID  mipsDspNoneEnableTask (PLW_CLASS_TCB  ptcbCur)
{
}
/*********************************************************************************************************
** 函数名称: mipsDspNonePrimaryInit
** 功能描述: 获取 DSP 控制器操作函数集
** 输　入  : pcMachineName 机器名
** 输　出  : 操作函数集
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
PMIPS_DSP_OP  mipsDspNonePrimaryInit (CPCHAR  pcMachineName, CPCHAR  pcDspName)
{
    _G_dspopDspNone.MDSP_pfuncEnable     = mipsDspNoneEnable;
    _G_dspopDspNone.MDSP_pfuncDisable    = mipsDspNoneDisable;
    _G_dspopDspNone.MDSP_pfuncIsEnable   = mipsDspNoneIsEnable;
    _G_dspopDspNone.MDSP_pfuncSave       = mipsDspNoneSave;
    _G_dspopDspNone.MDSP_pfuncRestore    = mipsDspNoneRestore;
    _G_dspopDspNone.MDSP_pfuncCtxShow    = mipsDspNoneCtxShow;
    _G_dspopDspNone.MDSP_pfuncEnableTask = mipsDspNoneEnableTask;

    return  (&_G_dspopDspNone);
}
/*********************************************************************************************************
** 函数名称: mipsDspNoneSecondaryInit
** 功能描述: 初始化 DSP 控制器
** 输　入  : pcMachineName 机器名
**           pcDspName     DSP 名
** 输　出  : NONE
** 全局变量: 
** 调用模块: 
*********************************************************************************************************/
VOID  mipsDspNoneSecondaryInit (CPCHAR  pcMachineName, CPCHAR  pcDspName)
{
    (VOID)pcMachineName;
    (VOID)pcDspName;
}

#endif                                                                  /*  LW_CFG_CPU_DSP_EN > 0       */
/*********************************************************************************************************
  END
*********************************************************************************************************/
