/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: net_perf_cfg.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2016 年 04 月 08 日
**
** 描        述: 网络性能参数配置.
*********************************************************************************************************/

#ifndef __NET_PERF_CFG_H
#define __NET_PERF_CFG_H

/*********************************************************************************************************
  缓存配置
*********************************************************************************************************/

#define LW_CFG_LWIP_MEM_SIZE            (1 * LW_CFG_MB_SIZE)            /*  网络内存大小                */
#define LW_CFG_LWIP_MSG_SIZE            512                             /*  内部消息队列缓冲长度        */
#define LW_CFG_LWIP_POOL_SIZE           1560                            /*  POOL 内存块大小             */
                                                                        /*  注意: 必须是字对齐的        */

#define LW_CFG_LWIP_NUM_INPKT           1024                            /*  协议栈接收队列大小          */
#define LW_CFG_LWIP_NUM_NETBUF          1024                            /*  缓冲网络分组 netbuf 数量    */
#define LW_CFG_LWIP_NUM_PBUFS           1024                            /*  系统总 pbuf 数量            */
#define LW_CFG_LWIP_NUM_POOLS           1024                            /*  pool 总数                   */
                                                                        /*  驱动程序与 AF_PACKET 使用   */
/*********************************************************************************************************
  ARP 队列缓存配置
*********************************************************************************************************/

#if LW_CFG_NET_ROUTER > 0
#define LW_CFG_LWIP_NUM_ARP_QUEUE       1024                            /*  工作在路由器模式需要配大些  */
#else
#define LW_CFG_LWIP_NUM_ARP_QUEUE       LW_CFG_LWIP_ARP_TABLE_SIZE
#endif                                                                  /*  LW_CFG_NET_ROUTER > 0       */

/*********************************************************************************************************
  SOCKET 默认缓存大小 (必须大于 LW_CFG_LWIP_TCP_WND)
*********************************************************************************************************/

#define LW_CFG_LWIP_DEF_RECV_BUFSIZE    0                               /*  0 表示最大 0 ~ (512 * 1024) */

/*********************************************************************************************************
  缓存方法 (tlsf 可以提高协议栈吞吐率, 但其使用的任务级 spinlock 会稍微影响任务抢占延迟)
*********************************************************************************************************/

#define LW_CFG_LWIP_MEM_TLSF            1                               /*  是否使用 tlfs 进行内存分配  */
#define LW_CFG_LWIP_MEM_TLSF_BRK        1                               /*  是否允许内存扩展            */
#define LW_CFG_LWIP_MEM_TLSF_BRK_TIMES  1                               /*  内存扩展倍数                */

/*********************************************************************************************************
  流控配置
*********************************************************************************************************/

#define LW_CFG_NET_FLOWCTL_MEM_SIZE     (  1 * LW_CFG_MB_SIZE)          /*  流量控制缓存大小            */
#define LW_CFG_NET_FLOWCTL_DEF_BSIZE    (512 * LW_CFG_KB_SIZE)          /*  每条规则默认缓存大小        */

/*********************************************************************************************************
  虚拟网卡
*********************************************************************************************************/

#define LW_CFG_NET_VNETDEV_DEF_BSIZE    (256 * LW_CFG_KB_SIZE)          /*  虚拟网卡发送缓存            */

/*********************************************************************************************************
  IP 参数
*********************************************************************************************************/

#define LW_CFG_LWIP_IP_REASS_MAXAGE     15                              /*  IP 分片生存时间             */

/*********************************************************************************************************
  网卡缓存优化设置 (如果 UDP 发送速度达不到要求, 可使能此配置宏, 优化网卡发送操作, 
                    缺点是网络内存消耗大, LW_CFG_LWIP_MEM_SIZE 需要配置的稍多)
*********************************************************************************************************/

#define LW_CFG_LWIP_TX_SINGLE_PBUF      1                               /*  是否在发送时使用连续缓存    */

/*********************************************************************************************************
  pbuf chksum on copy (如果网卡支持硬件 checksum 这里建议为 0)
*********************************************************************************************************/

#define LW_CFG_LWIP_CHECKSUM_ON_COPY    0                               /*  pbuf chksum on copy         */

/*********************************************************************************************************
  队列配置
  注意: LW_CFG_LWIP_JOBQUEUE_MERGE 如果允许 (1) 则会有多个任务同时从一个 jobq 取队列任务执行, 请确保在多核
                                   处理器上 jobq 里的驱动函数可以被并行运行.
        LW_CFG_LWIP_JOBQUEUE_NUM 必须为 1 或者 2 的指数次方, (小于等于 CPU 核心数量).
*********************************************************************************************************/

#define LW_CFG_LWIP_JOBQUEUE_MERGE      0                               /*  合并模式 (自动均衡)         */
#define LW_CFG_LWIP_JOBQUEUE_NUM        2                               /*  可使能多个 netjob 并行工作  */
#define LW_CFG_LWIP_JOBQUEUE_SIZE       512                             /*  sylixos job queue size      */

#if LW_CFG_CPU_WORD_LENGHT == 32
#define LW_CFG_LWIP_JOBQUEUE_STK_SIZE   4096                            /*  job queue stksize           */
#define LW_CFG_LWIP_DEF_STK_SIZE        8192                            /*  lwip thread default stksize */

#else
#define LW_CFG_LWIP_JOBQUEUE_STK_SIZE   8192                            /*  job queue stksize           */
#define LW_CFG_LWIP_DEF_STK_SIZE        16384                           /*  lwip thread default stksize */
#endif

/*********************************************************************************************************
  TCP 设置 
  关于 LW_CFG_LWIP_TCP_WND 不能大于网卡的接收缓冲区大小, 否则可能出现网卡接收溢出的错误, 造成网络速度颠簸.
  LW_CFG_LWIP_TCP_WND 有效值在 1460*2 ~ (0xffff << LW_CFG_LWIP_TCP_SCALE) 之间
  
  LW_CFG_LWIP_TCP_SCALE 为窗口扩大因子, 
  如果 LW_CFG_LWIP_TCP_SCALE 为 0 表示不使用窗口扩大选项
  LW_CFG_LWIP_TCP_WND, LW_CFG_LWIP_TCP_SND 最大值为 65535
  
  如果 LW_CFG_LWIP_TCP_SCALE 为 1 表示使用窗口扩大选项
  LW_CFG_LWIP_TCP_WND, LW_CFG_LWIP_TCP_SND 最大值为 65535 * 2^1 = 131070
  
  如果 LW_CFG_LWIP_TCP_SCALE 为 2 表示使用窗口扩大选项
  LW_CFG_LWIP_TCP_WND, LW_CFG_LWIP_TCP_SND 最大值为 65535 * 2^2 = 262140
  
  LW_CFG_LWIP_TCP_SCALE 最大值为 14, 建议最大设置不超过 3 ~ 4
*********************************************************************************************************/

#define LW_CFG_LWIP_TCP_WND             65535                           /*  TCP 默认接收窗口大小        */
#define LW_CFG_LWIP_TCP_SND             65535                           /*  TCP 默认发送缓冲大小        */
#define LW_CFG_LWIP_TCP_SCALE           2                               /*  窗口扩大指数 0 ~ 14         */

#define LW_CFG_LWIP_TCP_MAXRTX          8                               /*  TCP 最大重传数, 1 ~ 12      */
#define LW_CFG_LWIP_TCP_SYNMAXRTX       6                               /*  最大 SYN 重传数, 1 ~ 12     */

/*********************************************************************************************************
  AF_UNIX
*********************************************************************************************************/

#ifdef __SYLIXOS_LITE
#define LW_CFG_AF_UNIX_256_POOLS        64
#define LW_CFG_AF_UNIX_512_POOLS        16
#else
#define LW_CFG_AF_UNIX_256_POOLS        1024                            /*  256 字节大小内存池个数      */
#define LW_CFG_AF_UNIX_512_POOLS        1024                            /*  512 字节大小内存池个数      */
#endif

/*********************************************************************************************************
  PPPoS 缓存配置
*********************************************************************************************************/

#if LW_CFG_LWIP_TCP_WND < (32 * LW_CFG_KB_SIZE)
#define LW_CFG_LWIP_PPP_RBUF_SIZE       (32 * LW_CFG_KB_SIZE)           /*  PPPoS 接收缓存大小 32~128KB */
#else
#define LW_CFG_LWIP_PPP_RBUF_SIZE       (LW_CFG_LWIP_TCP_WND + (8 * LW_CFG_KB_SIZE))
#endif

#define LW_CFG_LWIP_PPP_WBUF_SIZE       (8 * LW_CFG_KB_SIZE)            /*  PPPoS 发送缓存大小 8~64KB   */

#endif                                                                  /*  __NET_PERF_CFG_H            */
/*********************************************************************************************************
  END
*********************************************************************************************************/
