/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                       SylixOS(TM)
**
**                               Copyright  All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: riscvMmu.h
**
** 创   建   人: Jiao.JinXing (焦进星)
**
** 文件创建日期: 2018 年 04 月 12 日
**
** 描        述: RISC-V 体系构架 MMU 驱动.
*********************************************************************************************************/

#ifndef __ARCH_RISCV_MMU_H
#define __ARCH_RISCV_MMU_H

VOID   riscvMmuInit(LW_MMU_OP  *pmmuop, CPCHAR  pcMachineName);
ULONG  riscvMmuAbortType(addr_t  ulAddr, UINT  uiMethod);

#endif                                                                  /*  __ARCH_RISCV_MMU_H          */
/*********************************************************************************************************
  END
*********************************************************************************************************/
